{"podcast_details": {"podcast_title": "Python Bytes", "episode_title": "#349 Djangonauts: Ready for Takeoff!", "episode_image": "https://pythonbytes.fm/static/img/podcast-theme-img_1400.webp", "episode_transcript": " Hello and welcome to Python Bites where we deliver Python news and headlines directly to your earbuds. This is episode 349, recorded August 21st, 2023, and I am Brian Auken. And I'm Michael Kennedy. And I've got, we have a lot of exciting stuff to cover this week. Um, and, but before we do, I'd like to thank our Patreon supporters and ourselves for, keeping this thing going even without sponsors. But if, uh, if you or your company would like to sponsor, uh, Python Bites, just talk to us. So anyway, uh, Michael, do you want to kick us off with the first story? Let's kick it off. Let's kick it off with some open source. That's not exactly Python. But when I talked about this on Macedon, you know what Macedon hasn't even changed his name this week. So that's pretty cool. I talked about a Macedon. There seemed to be quite a bit of excitement and interest in this. So I figured, you know what, let's make this a topic for Python Bites because there's two cool open source things. So surely you've heard of Instapaper. That's the OG. I want to read something later without ads, without distractions. You know, it's a lot of times it's not even ads. It's just like, wow, the fonts are so small on this website or the layout is so bad, you know? Yeah, I kind of forgot about Instapaper, but yeah. Yeah. Instapaper was the OG, right? Yeah. And then Pocket is probably the most well-known version of that. And you know, Pocket's kind of cool. It was either, I believe it was acquired by, not created by Mozilla, but yeah, Supporting Pocket kind of supports Mozilla, which kind of supports Firefox, which is good, but Google mostly supports Firefox. So there's that. So Pocket's pretty good, but there's this new project, let's say new to Michael, called Omnivore. It is the free open source Read It Later app for serious readers. Okay. Okay. So this thing is super, super nice. The integrations with, at least I've only tested it on iOS, but the integration with iOS are incredible. So it's really easy to go from something like Reader, right? Reader, which I've talked about before in the RSS world, but you know, you pick your RSS reader of choice, go through your articles, you hit share and boom, it just goes straight into Omnivore, which is pretty cool. And then it has a really nice way to like categorize, tag, all that kind of stuff. And then read it. So Brett Cannon, when I posted this, asked like, well, how do you find it compared to like Pocket and other stuff? Does it strip out too much, too many things? Henik jumped in and said, oh, this is way better. It seems to err a little bit on the side and leaving potentially a little bit too much stuff in, but at the same time, not removing quotes or code sections or things like that. So really, really nice. It's distraction free, privacy focused, open source. You can even self host it if you'd like. So for some reason you want, you're like, I'm going to read stuff and I want to make sure that it's completely private. Then you can set it up and run it on your own. Oh, that's pretty cool. That's pretty cool, right? Yeah. And one other thing that's quite neat about it, let me kind of pull through here a bit. So one of the things you can do, I don't know if it even shows it, but it obviously syncs where you've read. So you can go down and like if you've read 23% into an article, like a long, you know, 30 minute read time article and you switch to another device or to the web, it'll say, you know, here's how far you are. Resume from there. The other thing it does is it has text to speech, which, you know, that's, it sounds like a robot reading to you sometime, but they have a, like a high end text to speech option where there's not very many voices to choose from. But it sounds almost like a person reading the article to you. Oh, wow. And so that is that super nice. And it'll show you, you can have it like highlight the words as you, as it's reading along. And so if you, you got an article to read, but really also got the yard to mow, you know, seriously put it in the background and just go. It's actually, actually super, super neat. And what else? I think that's probably it. There's, you can even take highlights and stuff as you would expect, but it's really good for, you know, when you've got to do a lot of research on a project, it's, I think it's really good for us. Honestly, we read a lot of articles and you want to take notes, you know, highlight a section, add a note about why that's relevant and stuff. So when we go back to one of these long articles and we're like, hey, I want to tell Brian about her, vice versa. You're like, what was the part of this that actually stood out? Here it is. You know, you just bump through it. So really, really neat. And then it said, you can also sync it with other stuff, like your second brain things. I'm like, wait, what is it talking about? It says you can connect it to things like LogSec. LogSec is another open source thing that's kind of like Notion, but running locally. I think it runs locally. Anyway, so here's something else that I discovered along the way that's also pretty excellent. So you can do like whiteboards with like YouTube videos that connect over to different parts and like these sort of, it's kind of funky, but I haven't used that much. But Omnivore, strong recommendation for this. People should definitely, definitely check it out. That's pretty cool. I was thinking about that text to speech thing. I would have loved that when I was in college and I had to read a bunch of junk. Oh gosh, I know. And I'm on the bus or something. It would have been great. Yeah, you know, you're in a car, but you, at least for me, I can't really read in the car. I can read a little bit, but then I'm like, you know, just one wrong turn or one bump. And I'm like, you know what? Kind of woozy. I don't want to read in the car anymore. But this, you could totally do. I'm a big fan. I've started reading a lot more in the last week since I've been playing with this. Nice. Okay. Cool. Yeah. And Pat on the audience points out that Edge, the browser, has good voices when you use read aloud. So, pretty cool. Edge, what's that? I think it's some kind of browser. Okay. Just kidding. You know, it's Chromium. If you say the word browser and it's not Firefox, it's really just Chromium. Yeah. Isn't, isn't Vivaldi based on Chromium? Vivaldi is, Brave is, they all are, yeah. Well, Firefox isn't, is it? Or is it? No, but Firefox is the standout. It's the holdout. Which is like the main reason I love them. So. What I kind of, is Google like supporting them so that they don't look like a monopoly? Just to make sure. That's a pretty strong theory, isn't it? I mean, I'm not saying that, but you said that. Anyway. I think 80 to 90% of Mozilla's revenue comes from Google. Which I think also leads to a little bit of perverse incentives, right? Like Firefox would be better if it could be more assertive in ad blocking and more assertive in privacy. I know it kind of has it, but not really. Like it could go way more in like Vivaldi or Brave does. Except it's almost entirely single customer is an ad company. So. Yeah. How much, yeah, it's a little, it's a little weird, but it does keep Firefox alive. So there's that. Over to you. What's next? Well, I'd like to talk about Django a little bit. And actually people learning about Django. So I learned about this place called Django.NOT.DAT.Space. It's where contributors launch. So kind of a fun kind of a fun drop or home page. But I mean, if you click on anything, you go to just like a docs thing. But that's alright. The Django.NOT program is kind of neat. It's a program to help people learn Django, like really dig into it. So it's a, it says this program places an emphasis on group learning, sustainability, and longevity. Django.NOT.DAT. are members of the community who wish to level up their current Django code contributions and potentially take on leadership roles in Django in the future. So this is pretty cool. It's a self-paced, semi-structured learning environment with group mentoring and it's in three month chunks. So, and they have like different cohorts and then there's like different documentation on if you want to be a Django.NOT. If you want to be a navigator, which is people leading other Django.NOT.DAT. And then a captain and stuff like that. This is actually just kind of a neat, I'd love to talk to somebody that has been involved in this or maybe it's new. I'm not sure. It doesn't look like it's been around for much for very long. So I'm not sure if they already have cohorts gone through or not. But I'd love to hear more about how it's going. Because this is kind of a model for an open source project. It seems neat. The people that kind of want to get more involved but really don't know what to do or how to get further. Maybe like having a guided thing. That's awesome. So the other thing, one of the things I think that's really cool about this is the small group setting. So this is said cohorts are no more than four Django.NOT.DAT. per one navigator. And no more than eight Django.NOT.DAT. in a group. So you might have like two navigators per group, which is kind of neat. Three months. And then one of the things, they have access to a private Discord server. And then programs receive support from captains. I haven't dug in too much. I'm not sure what a captain does. Oh, captains help organize the program and reduce the admin burden of navigators. Neat. One of the goals here is of course to do peer mentoring and to get people leveled up a lot. But one of the things that I think is really cool here is even if you think you sign on, I can't find where it's in the docs right here, but somewhere it said basically you sign up, you think you're going to do it. But life happens and you need to not work on it so much. Do that. I mean that's more important. So I love the humanity in there of saying personal health is always above things like this. So it's neat. Django does community like no other web framework, right? I mean seriously. This is a fantastic idea. Yeah, I think it's pretty cool. The welcome summary, welcome in summary for the Django is pretty cool. Oh, here it is. The program will have a focus on sustainability and longevity. Remember that while we want you to be successful, your health and happiness comes above all else. I just love it. It seems like a cool program. This is great. So comment from the chat. Kids today have it so easy. This makes open source contributions look like a cruise. I think that we just need to make it easier for the next generation to come in and help take over. So I think it's great. Yeah, I used to have to do my pull requests uphill both ways. I used to have to mail zip files to people. Exactly. Get all sneaker net. This is a great thing for people to sign up to. And I guess presumably you just go there and it tells you how to sign up and register to possibly be part of it. Yeah, so let's see. If I click sign up, oh yeah, it takes me to sign up form. You fill out your... Oh, you can even sign up as a navigator or captain if you want to help out. That's cool. Or an other. I want to try to sign up as a cheerleader. You can't label me, man. You can't label me. I'm just going to be here. But you have to label yourself. If you pick other, you have to pick something. Alright, well Michael, I want to... This is on to another one here. This one is from me. Actually, something I created this week I want to give a shout out to because I think it's just going to help people a ton. And it's going to lead over to maybe some more Django stuff. And then later we'll come back to a Google form. Let's start with this. So I'll set the stage. So if you're working on a website, especially the web design aspect of a website, what you often do is you'll go over to your CSS file, you'll make some changes, you'll have to reload your page. You go over to the browser, Ctrl or Command R or F5, whatever your system does. You reload it, you'll look at it. Okay, great. Maybe sometimes you need it on mobile. So you'll have like one of those device minif... sort of device sized changes for your browser. Or you could open up a real iPhone or an iPhone simulator pointed at it. Maybe you have both of those side by side. So you've got to refresh one, refresh the other, go back to your CSS. Now you go over to your HTML, you add some classes. Go back, see how it looks, refresh it, right? What would be cool is if you could just have on a second monitor or on a large monitor off to the side your browser and as you type, when you hit save, regardless whether you're editing CSS, JavaScript, HTML, whatever, the page just refreshes and shows you the new view. That'd be awesome, right? So I created a JavaScript script that you include only in development time, so don't forget that. You put it at the top of your page, it does exactly that. So you can have an iOS simulator running, you can have Brave, let's say, running over there, then over to the side you work on your editor and as you hit save, any file you want, right? HTML, templates, whether it's CSS, JavaScript, just reloads, even images without touching it. Isn't that cool? Okay, so I've got my editor set up to just save all the time. So it's going to save junk. Does it just like... what happens if I've got junk saved? Well, so if you're typing in the HTML, it'll probably go a little bit wonky. If it's Python, though, it depends on what you want to do. So for me, what I found is that I'm not needing it to reload almost constantly when I'm doing the logic of the website. Like sometimes I want it to, but not all the time. Whereas when I'm actually messing with the CSS and I'm actually messing with the Python, then you want to do it all the time, right? So the way it works, if you don't take any action, is it will reload if the contents of the page change. So if you don't restart your Python web setup, even as you type, it's not going to... presumably you wouldn't have it set up because like every keystroke would restart it and that would be like pretty annoying. Yeah, well that's what I was worried about too. So there's a few other projects like Alex... first of all, I just want to give Alex Revere a shout out for helping me sort of modernize the script. He says, hey, that's cool, you want me to like a more modern version of it? I'm like, yes, please. My JavaScript is not that good. And then Adam Chains pointed out that he created Django Browser Reload which does something somewhat like this for Django where it looks and it says, you know, if my Django code is changed and the server's been restarted, then reloaded. If it... he says it does static files, although I haven't... I don't know that it's necessarily showing... passing through enough information to really reliably do that. You know, like for caching it might still load a stale version of something. But anyway, if you're doing... this is like a web hook thing, so you install something inside of your website on the server and then the script and those like coordinate, right? And I specifically decided I don't want that. Like this would work on node, this would work on pyramid. The example I'm playing with now is Fast API, Tailwind, all those things. So like it doesn't matter what's on the server, right? And so that's a trade off because it's a little bit more chatty checking back with the server but not... I find that just I include a script, this happens. I don't include the script. It doesn't... there's no difference. That's nice to me. Yeah. So yeah, like I said, you just include a script and make sure that you don't do it in production. It checks by default every second but you can change that to whatever. You can open up your dev console and toggle it on and off. So like I need you to not mess with it because I'm going to set a break point and if you keep requesting this page over and over, you're going to make me crazy and screw up the debugging session. So it works even indirectly. So like I'm doing Tailwind. So I edit a source CSS file. Tailwind watches that, builds a new CSS file. That CSS file is included in the HTML. The HTML is smart enough to put a little version hash identifier on the CSS anytime it changes. That triggers a change to the HTML which reloads. So like same thing for images, same thing for JavaScript. So anytime there's like a static resource change, as long as you do something like this, it'll pick it up. So if you're doing web development, especially while you're doing the design side, you know, consider grabbing this little script. I don't know how big it is. It's small. It is... let's go. Pull it up. I don't know how many lines it is. Probably it's like two and a half pages. One of those pages is comments. So that's no big deal. So you can just store it in there and try it if you like. It's really nice. It even works over the network if you can get to the server with ngrok or something like that. Cool. Yeah. Works outside of Python as well, but built for Python. I was working on Fast API when I built it. Nice. Alright. Over to you. What's next? Well, we just... this is hot off the presses, at least for us. Matthew Feichert let us know this morning... Hey, seems like the day has finally come for Excel users to rejoice and use Python in Excel. So what is he talking about? There's an announcement from Anaconda that Python and Excel next level data analysis for all. So what does this look like? It says you can write Python code directly in a Microsoft Excel grid. No Python install required. So I don't know much about this. Haven't played with it, but it looks fun. It's like all you need is equal pi, equal like py. Oh, there's a little video. Cool. So you just say pi and then you can just type in some code. I don't know how much coding I want to do right in a Python or in an Excel cell, I guess. But I don't know. It sounds kind of neat. It says you can use Matplotlib and Seaborn and stuff like this. So I'm not sure how this works. Is it just built into Excel now? I don't know. Anyway, I'm excited about it. So I guess I should have researched it a little bit more before talking about it, but neat. Yeah, people can check it out. I don't know. I have heard rumors of Python coming to Excel and this looks like it's coming from Anaconda. So I'm not sure if this is the same thing or if this is something different. Yeah. It says experience the power of Python and Excel for yourself. Windows users can sign up here. So that's a... Click on that. Where does that take you? A Microsoft thing. I'm interested. So it is part of the 365 Insider program right now to use this feature. So kind of neat. Oh, neat. A little insert. Wow. Start using Python. Insert the formula. Yeah, I gotta do some more research on this before I can say for sure. But you know, if we can save the world from doing VBA, let's do it. Yeah, but I think as far as getting this right, I think it's pretty cool to have Anaconda and Microsoft working together to make this work. I think those are the right partners to look into this. So yeah. Anyway, I wonder if I... I don't think I'm part of this beta channel thing. So I don't think I can try it, but I'd like to. Anyway. So that's... Yeah, I'm not part of the beta program either. I'm not that excited about Office, but I'm excited that this is really cool. Yeah, I am having to do more and more spreadsheets as my management-y sort of things increase, so does Excel. It's just part of it. Anyway. Yeah, there's also some other companies and projects out there that have kind of Google Doc-like hosted spreadsheets that are purely Python-based. I can't remember the name. I don't want to talk to so many companies at the startup, bro. I don't want to misrepresent them. I would say, you know, cross one over with the other. But that looked really, really cool as well. And it was only Python. So I don't know. There's a lot of stuff happening around this right now, and it's pretty exciting. Yeah. I guess just a step in the right direction, so that's good. It was. Five years ago, this was the single biggest user voice, single most uploaded user voice thing in the Microsoft request for features and ideas, and it just got no reply. Like, they just ignored it. It was crickets below it, right? And so it's interesting that it finally got some traction. Yeah. I think it's pretty cool. So maybe we'll see. If anybody out there has played with it or knows anything, let me know. It'd be great. Yeah. Or throw a comment at the bottom of YouTube. Livestream. Oh yeah, that's a good idea. For folks. Yeah. Alright. Alright. Well, those are our items. Do you have any extras for us? I have two things that are extra. Let's talk about them. PyCon Sweden. The call for proposals is out. And it will be in 78 days, 12 hours, 29 minutes, 16 seconds on November 9th and 10th. Okay. Don't know if I can attend online or in person. It looks like it will be at the Hilton Sduzen. So I'm guessing that that's not online. So people can check that out there. It sounds like it'd be pretty awesome. I would go to. I would too. But it's quite the flight from here. Never been to Sweden. Alright. Anything else? No, neither have I. I have been to Norway, been to Amsterdam, but not there. One more thing. So I'm looking to do a Talk Python episode around mobile apps and Python. And this got started as a listener's like, hey, I'd really love to hear about how you built and how was Python serving as the backend for your Flutter redesign for your mobile apps, right? Because it's all Python APIs, but it's something else on the front end. They're like, how did you decide to not use something in Python for the front end? Or how did you decide on what you used? And a couple other people had some thoughts as well. So I think it might be really fun to do an episode where people who have created or work with, you know, either they're the backend dev or the front end dev or across the board, created mobile apps that are actual apps in the app store. Not just like, oh, I tried this framework. But if you have an app in the app store and it has Python involved deeply in some way, right? Maybe the APIs are in Python or there's some other way in which Python is involved. Maybe you're somehow embedding Python into the app or even, you know, maybe it's a Kivy app or something like that. If you're interested in being on TalkPython in a panel to kind of talk about like, you know, what are people doing with Python and mobile these days? I think that would be a lot of fun. I'd love to have you on that show. So the link for this is in the podcast, Flutter Show Notes. I will not read it out, but it says be on TalkPython around mobile apps. The link is tremendously long. So go click that in the Show Notes or the episode page and just, you know, give us your name, what's your app about, like how it's built and maybe a couple of the really short things. So I'd love to put it together an episode like that, but it's really hard to know who to invite because it's not entirely obvious looking in from the outside, you know? Yeah. So call, it's kind of a call for proposals to TalkPython, I suppose. And the second appearance of a Google form. Flet, Blaise says Flet. Yeah, Flet is pretty excellent. Flet is, I had the Flet folks on TalkPython and Flet is basically a Python wrapper around Flutter. You don't know that they have App Store support yet. Maybe they do. Is Flet the past tense of Flutter? I am fluttering, I did Flet. Yes, exactly. It has something about PyCon 2024 on there. But anyway, Flet is really interesting. I did talk to, I can't remember the guy's name over on TalkPython, but I remember it was not quite ready for the App Stores, but that was a while ago. So if it's made it further on, sure, Flet would be an awesome part of that discussion. Neat. I think I might check that out. I can't wait. Yeah, can't wait. Yeah, thanks. Okay, so I have, I've just, I've been so busy lately because I'm working on this PyTest course and I find, we announced it last week, but I finally, like yesterday morning or something, I finally put it up on my blog, PyTest, so PythonTest.com courses, you can finally find it. You can also find the one that I have up on TalkPythonTraining, there's a link to that. And it's still a great course. Some people asked me was that like different? It is different, but it's a TalkPythonTraining one is like a, is a good like starter one to like just get you going on PyTest. And it's still awesome. And it's not outdated or anything. The new one is just, is like the full book, but I'm really trying to keep every, it's not just the full book, it's a whole bunch of extra stuff too. But it's not, I just wanted to mention it's up on PythonTest.com slash courses now, so you don't have to find the link. Because it links to, it's a teachable site, so it links to that one. But the, because I hadn't really announced it really everywhere, I've extended the, last week we said there was a 20% discount. I've extended that 20% discount till the end of the month. So it'll be in the show notes, it's just PythonBytes, all one word, and it's 20% discount. So, and a whole bunch of people have signed up so far, or enough to make me believe it's a good idea to do this, and I really appreciate the support and the encouragement. I'm really having fun with the fixtures chapter, because fixtures are a thing that is hard to get your head around, and I'm really putting a lot of extra effort, putting some drawings in and stuff, so it's going good. I guess that's my extra so far, is just, this is going well. Yeah, great, glad to hear it. It's exciting to see people interacting with the stuff you build, and I remember when I did a Kickstarter for the first course that I did, I had an early access aspect to it, and it was fun. Yeah, and I think I'm going to try to do, I'm not going to promise this, but I'm going to try to do some open hours, or office hours, things associated with this also. I just don't have any time this week, so I'm not sure when I'll try to fit that in, but yeah, it'll be good. Alright, how about something funny? How about two somethings funny? Yeah, do you want to start with mine, or yours? Yours. Okay, somebody, I can't remember where I saw this, but I just think it's hilarious. I was looking for secure password generators, and I've got one on my phone, but I wanted one like a web accessible one that I could just look up. Kenny Logins, it's kennylog-in.com, and it's a password generator based on Kenny Logins songs. Something about the highway to the danger zone, and all those things. So you can pick- Oh, the danger zone is weak, oh no. The danger zone is yeah, because it's the danger zone. So you can just click which, how secure you want it, and then you hit generate, and then it generates a, so head up like a king, I don't know, with some symbols in there. It's a pretty secure password for a weak one. Okay, watching the river run. Nowhere to hide, no way to hide. And then, okay, so alright, I'm alright is alright, like security, and I guess they're just a little bit longer. Anyway, and then strong passwords, this is it. There we go. Yeah, those are, but there's like mixed capitalizations and stuff. These would be harder to remember. That's actually a really good password, that's a totally valid one. These are all pretty good. It's just, I thought it was really funny to have a themed password generator. It's awesome. So you have F14 with Maverick in the sky back there leaving a entree with a password in it. And I don't know if it's a generational thing, but I can't even hear the phrase danger zone without it playing in my head. I know. It's pretty good stuff. Alright. Okay, what do you got? Speaking of the theme here, the password game. Do you want to play it? Sure. At neil.fun slash password dash game. It says choose a password. Okay. I like the letter A. I'll typically go with that. So it's gotta be five characters. So there we go. Then it says alright, cool, you pass a couple of things. It has to include a number because I type 5AAA, or wait, 5555. It says it must include an uppercase A. It must include a special character. Bang. What else would you put? Your digits must add 25. So I gotta put another five in there. It could go at the end though. It doesn't have to be in order. It must include, yeah, so May must include a sponsor in here. So Pepsi, one of their sponsors, right? So it shows their sponsors. You gotta use it. And then Roman numerals should multiply to five. This is all additive under the rules. Roman numerals in your, let's see, what is five in a Roman numeral? V, right? V and then VII. Oh, come on. That's five times seven. Whatever. I can't do Roman numeral multiplicative math, so I'm done. I can't create an account apparently, but here we are. Roman, let's look it up. Roman 35. It has to multiply. It has to be two numbers that multiply to 35. Roman numerals in your password should multiply to 35. So like seven and five, right? Yeah, that's what I thought. I thought I did VII and V or is that like, I can't get rid of the M. Oh, yeah, it says there's a problem with the M because that's May. I gotta do a lower case. There we go. Thank you, Pat. Wait, no. Thank you, Mike. So I had May capitalized because it's a formal noun, but it was being treated as a Roman number. Must include this captcha. Okay. It doesn't recapture. You gotta type it. Let's keep going. Y, four, N, six, M. But now my digits don't add up anymore and there were digits, there were digits in the captcha. Okay. I must preclude today's word elated. Okay, then I'm completely out. I'm done. I'm out. I'm out. This is good. Yeah. Nice. I personally just use a proper password manager and let it guess. Yeah, or. Let it come up with one. Yeah. Or Kenny Loggins. Kenny Loggins. It's always there for you. Oh, look at. Talk to me, Goose. Talk to me. Come on. Oh, look at the bottom. Look at all the old computers and stuff at the bottom. We got a Commodore. Oh, I love it. It's got like an Atari 2600. Yeah. Anyway. Joystick. Well, this was a great episode. Nice funny passwords at the end. Thanks a lot again. And we'll talk next week."}, "podcast_summary": "Thank you for listening to this episode of Python Bytes. Be sure to subscribe on your favorite podcast app and give us a rating and review. You can also follow us on social media. We are @PythonBytes on Twitter and @PythonBytes Podcast on Facebook and LinkedIn. If you have any feedback, feel free to reach out to us. We'd love to hear from you. Finally, you can find me on Twitter @AssistantToNeil and Michael is @M Kennedy. Thank you and see you next time.", "podcast_guest": "Django.NOT", "podcast_highlights": "You're welcome. I look forward to it. Have a great week!"}